#+TITLE: June 17-July 3, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-06-17 Mon>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-sandeepk: 2
  :END:
** akshay196
*** IN_PROGRESS GNU Emacs bug triaging [3/4]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   3.35
    :OWNER: akshay196
    :ID: OPS.1560792095
    :TASKID: OPS.1560792095
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-21 Fri 20:57]--[2019-06-21 Fri 21:57] =>  1:00
    CLOCK: [2019-06-20 Thu 23:09]--[2019-06-20 Thu 23:34] =>  0:25
    CLOCK: [2019-06-19 Wed 21:25]--[2019-06-19 Wed 22:20] =>  0:55
    CLOCK: [2019-06-18 Tue 21:44]--[2019-06-18 Tue 22:45] =>  1:01
    :END:
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35567][#35567]]: 27.0.50; Emacs-Lisp and ElDoc confusion with some strings
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35797][#35797]]: 26.2; Adaptive Wrap does not respect Whitespace Mode faces
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35815][#35815]]: 26.2; mhtml-mode (in HTML+CSS and HTML+JS) doesn't respect Whitespace Mode face settings
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32784][#32784]]: 25.2; Calc mode home on incorrect line depending on line-spacing
*** IN_PROGRESS Learning GNU Emacs - Part I [2/10]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   2.93
    :OWNER: akshay196
    :ID: READ.1560794346
    :TASKID: READ.1560794346
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-24 Mon 08:06]--[2019-06-24 Mon 09:35] =>  1:29
    CLOCK: [2019-06-23 Sun 06:33]--[2019-06-23 Sun 08:00] =>  1:27
    :END:
    3rd Edition
    by Bill Rosenblatt, Eric S. Raymond, Marc Loy, James Elliott, Debra Cameron
    - [X] Chapter  1. Emacs Basics                                   ( 1h)
    - [X] Chapter  2. Editing                                        ( 1h)
    - [ ] Chapter  3. Search and Replace                             ( 1h)
    - [ ] Chapter  4. Using Buffers, Windows, and Frames             ( 1h)
    - [ ] Chapter  5. Emacs as a Work Environment                    ( 2h)
    - [ ] Chapter  6. Writing Macros                                 ( 1h)
    - [ ] Chapter  7. Simple Text Formatting and Specialized Editing ( 2h)
    - [ ] Chapter  8. Markup Language Support                        ( 2h)
    - [ ] Chapter  9. Computer Language Support                      ( 1h)
    - [ ] Chapter 10. Customizing Emacs                              ( 1h)

** bhavin192
*** IN_PROGRESS Linux Under the Hood [4/13]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   4.03
    :OWNER:    bhavin192
    :ID:       READ.1559581076
    :TASKID:   READ.1559581076
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-24 Mon 08:26]--[2019-06-24 Mon 08:31] =>  0:05
    CLOCK: [2019-06-21 Fri 19:32]--[2019-06-21 Fri 19:43] =>  0:11
    CLOCK: [2019-06-21 Fri 19:10]--[2019-06-21 Fri 19:29] =>  0:19
    CLOCK: [2019-06-21 Fri 18:43]--[2019-06-21 Fri 19:03] =>  0:20
    CLOCK: [2019-06-19 Wed 19:17]--[2019-06-19 Wed 20:16] =>  0:59
    CLOCK: [2019-06-18 Tue 20:00]--[2019-06-18 Tue 20:34] =>  0:34
    CLOCK: [2019-06-18 Tue 19:29]--[2019-06-18 Tue 19:52] =>  0:23
    CLOCK: [2019-06-17 Mon 19:31]--[2019-06-17 Mon 20:10] =>  0:39
    CLOCK: [2019-06-17 Mon 18:53]--[2019-06-17 Mon 19:25] =>  0:32
    :END:
    https://www.oreilly.com/library/view/linux-under-the/9780134663500/
    - [X] 1.  How Linux is organized                            (25m)
    - [X] 2.  About C code, scripts and compiled programs       (35m)
    - [X] 3.  Understanding Linux commands and how they work    (22m)
    - [X] 4.  Understanding the Linux boot procedure            (90m)
    - [ ] 5.  Understanding Linux storage                       (80m)
    - [ ] 6.  Understanding memory management                   (40m)
    - [ ] 7.  Understanding processes                           (40m)
    - [ ] 8.  Security                                          (60m)
    - [ ] 9.  Hardware initialization                           (35m)
    - [ ] 10. Looking closer at the kernel                      (40m)
    - [ ] 11. Understanding networking                          (50m)
    - [ ] 12. Performance optimization                          (60m)
    - [ ] 13. The future of Linux                               (23m)
*** Namespaces in operation series [0/9]
    :PROPERTIES:
    :ESTIMATED: 4.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1560960967
    :TASKID:   READ.1560960967
    :END:
    https://lwn.net/Articles/531114/#series_index
    - [ ] [[https://lwn.net/Articles/531114/][1. namespaces overview]]                                      (60m)
    - [ ] [[https://lwn.net/Articles/531381/][2: the namespaces API]]                                       (25m)
    - [ ] [[https://lwn.net/Articles/531419/][3: PID namespaces]]                                           (20m)
    - [ ] [[https://lwn.net/Articles/532748/][4: more on PID namespaces]]                                   (35m)
    - [ ] [[https://lwn.net/Articles/532593/][5: User namespaces]]                                          (30m)
    - [ ] [[https://lwn.net/Articles/540087/][6: more on user namespaces]]                                  (25m)
    - [ ] [[https://lwn.net/Articles/580893/][7: Network namespaces]]                                       (15m)
    - [ ] [[https://lwn.net/Articles/689856/][Mount namespaces and shared subtrees]]                        (30m)
    - [ ] [[https://lwn.net/Articles/690679/][Mount namespaces, mount propagation, and unbindable mounts]]  (20m)
*** Architecture for continuous delivery
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1560961999
    :TASKID:   READ.1560961999
    :END:
    https://learning.oreilly.com/live-training/courses/architecture-for-continuous-delivery/0636920276012/
** sandeepk
*** IN_PROGRESS Reliable Cloud Infrastructure: Design and Process [8/9]
    :PROPERTIES:
    :ESTIMATED: 17.33
    :ACTUAL:   10.07
    :OWNER:    sandeepk
    :ID:       READ.1559588374
    :TASKID:   READ.1559588374
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-22 Sat 16:30]--[2019-06-22 Sat 17:20] =>  0:50
    CLOCK: [2019-06-22 Sat 15:20]--[2019-06-22 Sat 16:25] =>  1:05
    CLOCK: [2019-06-22 Sat 14:20]--[2019-06-22 Sat 15:00] =>  0:40
    CLOCK: [2019-06-21 Fri 21:53]--[2019-06-21 Fri 22:53] =>  1:00
    CLOCK: [2019-06-21 Fri 21:07]--[2019-06-21 Fri 21:38] =>  0:31
    CLOCK: [2019-06-20 Thu 21:14]--[2019-06-20 Thu 22:25] =>  1:11
    CLOCK: [2019-06-19 Wed 20:33]--[2019-06-19 Wed 23:15] =>  2:42
    CLOCK: [2019-06-18 Tue 21:36]--[2019-06-18 Tue 23:41] =>  2:05
    :END:
    - [X] Welcome to Design and Process                              (20m)
    - [X] Defining the Service                                       (4h)
    - [X] Business-logic Layer Design                                (4h)
    - [X] Data Layer Design                                          (2h)
    - [X] Presentation Layer                                         (2h)
    - [X] Design for Resiliency, Scalability, and Disaster Recovery  (1h)
    - [X] Design for Security                                        (1h)
    - [X] Capacity Planning and Cost Optimization                    (1h)
    - [ ] Deployment, Monitoring and Alerting, and Incident Response (2h)
*** Blog writing [0/2]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    - [ ] Blog about Google Cloud Platform VPC(Virtual Private Network)       (4h)
    - [ ] Blog about Google Cloud Platform IAM(Identiy and Access Management) (4h)
*** Project Stack NEWS - Part III [0/2]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    - [ ] Implement Comment logic          (4h)
    - [ ] Write test case for POST section (5h)
